## Project 1: Build Decision Tree(DV-"Survived",IDV-"Age,Gender and Fare") and Prediction

In [236]:
import numpy as np
import pandas as pd
from sklearn import tree
from sklearn import preprocessing
from sklearn.ensemble import RandomForestClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.preprocessing import LabelEncoder

In [237]:
titanic = pd.read_csv("D:/DS/AI ML DL/Let'sUpgrade/Class Materials/day 24/train.csv")

In [238]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [239]:
titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [240]:
label_encoder=preprocessing.LabelEncoder()
titanic["Sex"]=label_encoder.fit_transform(titanic["Sex"])
titanic["Embarked"]=label_encoder.fit_transform(titanic["Embarked"])
titanic.head(2)
# categorical features encoded to numeriacal

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,0

In [241]:
X=titanic[['Age','Sex','Fare']]

In [242]:
Y=titanic['Survived']

In [243]:
Dt=DecisionTreeClassifier(max_depth=8)

In [244]:
Dt.fit(X,Y)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=8, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [245]:
Dt.score(X,Y)
# score is depend on max_depth

0.8706411698537683

In [246]:
with open("D:/DS/AI ML DL/Let'sUpgrade/Class Materials/day 24/dtree_titanic.dot",'w') as f:
    f=tree.export_graphviz(Dt,feature_names=['Age','Sex','Fare'],out_file=f);

### Prdiction on test data

In [247]:
tit_test=pd.read_csv("D:/DS/AI ML DL/Let'sUpgrade/Class Materials/day 24/test.csv")

In [248]:
tit_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S

In [249]:
tit_test.isna().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [250]:
tit_test.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,417.0,1100.635492,120.923774,892.00,996.0000,1101.0000,1205.0,1309.0000
Pclass,417.0,2.263789,0.842077,1.00,1.0000,3.0000,3.0,3.0000
Age,417.0,33.237410,13.922884,0.17,23.0000,32.0000,45.0,76.0000
SibSp,417.0,0.448441,0.897568,0.00,0.0000,0.0000,1.0,8.0000
Parch,417.0,0.393285,0.982419,0.00,0.0000,0.0000,0.0,9.0000
Fare,417.0,35.627188,55.907576,0.00,7.8958,14.4542,31.5,512.3292

In [251]:
tit_test["Sex"]=label_encoder.fit_transform(tit_test["Sex"])
tit_test.head(2)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,3,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,S

In [252]:
X1=tit_test[['Age','Sex','Fare']]

In [253]:
test_pred=Dt.predict(X1)

In [254]:
pred_output=pd.DataFrame({'PassengerId':tit_test['PassengerId'],'Survived':test_pred})

In [255]:
pred_output

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
412         1305         0
413         1306         1
414         1307         0
415         1308         0
416         1309         0

[417 rows x 2 columns]

In [256]:
pred_output.to_csv("D:/DS/AI ML DL/Let'sUpgrade/Class Materials/day 24/Output.csv")

In [257]:
predictors=pd.DataFrame(titanic[['Age','Sex','Fare']]).T

In [258]:
rf_model=RandomForestClassifier(n_estimators=1000,max_features=2,oob_score=True)

In [259]:
features=["Sex","Age","Fare"]

In [260]:
rf_model.fit(X=titanic[features],y=titanic["Survived"])

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=None, max_features=2,
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=1000,
                       n_jobs=None, oob_score=True, random_state=None,
                       verbose=0, warm_start=False)

In [261]:
print("OOB Accuracy:",rf_model.oob_score_)

OOB Accuracy: 0.7896512935883014